piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32F2xQI/src/MDR32F2xQI_adcui.c
/**
 *******************************************************************************
 * @file    MDR32F2xQI_adcui.c
 * @author  Milandr Application Team
 * @version V1.0.0
 * @date    24/05/2023
 * @brief   This file contains all the ADCUI firmware functions.
 *******************************************************************************
 * <br><br>
 *
 * THE PRESENT FIRMWARE IS FOR GUIDANCE ONLY. IT AIMS AT PROVIDING CUSTOMERS
 * WITH CODING INFORMATION REGARDING MILANDR'S PRODUCTS IN ORDER TO FACILITATE
 * THE USE AND SAVE TIME. MILANDR SHALL NOT BE HELD LIABLE FOR ANY
 * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES RESULTING
 * FROM THE CONTENT OF SUCH FIRMWARE AND/OR A USE MADE BY CUSTOMERS OF THE
 * CODING INFORMATION CONTAINED HEREIN IN THEIR PRODUCTS.
 *
 * <h2><center>&copy; COPYRIGHT 2025 Milandr</center></h2>
 *******************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "MDR32F2xQI_adcui.h"

/** @addtogroup __MDR32F2xQI_StdPeriph_Driver MDR32F2xQI Standard Peripherial Driver
 * @{
 */

/** @addtogroup ADCUI ADCUI
 * @{
 */

/** @defgroup ADCUI_Private_Defines ADCUI Private Defines
 * @{
 */
#define IS_ADCUI_SAGLVL(SAGLVL)      ((SAGLVL) <= 0xFFF)
#define IS_ADCUI_SAGCYC(SAGCYC)      ((SAGCYC) <= 0xFF)
#define IS_ADCUI_ZXTOUT(ZXTOUT)      ((ZXTOUT) <= 0xFFF)

#define IS_ADCUI_FXPHASE(PHASE)      ((PHASE) <= 0xFF)
#define IS_ADCUI_FXIRMSOS(RMSOS)     ((RMSOS) <= 0xFFF)
#define IS_ADCUI_FXPER_FREQ_DIV(DIV) ((DIV) <= 0x1FFFF)

#define IS_ADCUI_FXIPKLVL(DIV)       ((LVL) <= 0xFFFF)
#define IS_ADCUI_FXVPKLVL(DIV)       ((LVL) <= 0xFFFF)

#if defined(USE_MDR32F21QI)

#define DEINIT_FLAGS (ADCUI_FxSTAT_FxVF_OVR |   \
                      ADCUI_FxSTAT_FxIF_OVR |   \
                      ADCUI_FxSTAT_FxSAGF |     \
                      ADCUI_FxSTAT_FxPEAKVF |   \
                      ADCUI_FxSTAT_FxPEAKIF |   \
                      ADCUI_FxSTAT_FxWATTOVP |  \
                      ADCUI_FxSTAT_FxVAROVP |   \
                      ADCUI_FxSTAT_FxVAOV |     \
                      ADCUI_FxSTAT_FxZXTOF |    \
                      ADCUI_FxSTAT_FxFAULTCON | \
                      ADCUI_FxSTAT_FxAPSIGN |   \
                      ADCUI_FxSTAT_FxVARSIGN |  \
                      ADCUI_FxSTAT_FxZEROCRS |  \
                      ADCUI_FxSTAT_C3IF_OVR |   \
                      ADCUI_FxSTAT_FxWATTOVN |  \
                      ADCUI_FxSTAT_FxVAROVN)

#elif defined(USE_MDR32F23QI)

#define DEINIT_FLAGS (ADCUI_F0STAT_F0VF_OVR |   \
                      ADCUI_F0STAT_F0IF_OVR |   \
                      ADCUI_F0STAT_F0SAGF |     \
                      ADCUI_F0STAT_F0PEAKVF |   \
                      ADCUI_F0STAT_F0PEAKIF |   \
                      ADCUI_F0STAT_F0WATTOVP |  \
                      ADCUI_F0STAT_F0VAROVP |   \
                      ADCUI_F0STAT_F0VAOV |     \
                      ADCUI_F0STAT_F0ZXTOF |    \
                      ADCUI_F0STAT_F0FAULTCON | \
                      ADCUI_F0STAT_F0APSIGN |   \
                      ADCUI_F0STAT_F0VARSIGN |  \
                      ADCUI_F0STAT_F0ZEROCRS |  \
                      ADCUI_F0STAT_C3IF_OVR |   \
                      ADCUI_F0STAT_F0WATTOVN |  \
                      ADCUI_F0STAT_F0VAROVN)

#endif

/** @} */ /* End of group ADCUI_Private_Defines */

/** @defgroup ADCUI_Exported_Functions ADCUI Exported Functions
 * @{
 */

/**
 * @brief  Deinitializes the ADCUI peripheral registers to their default reset values.
 * @param  None.
 * @retval None.
 */
void ADCUI_DeInit(void)
{
    MDR_ADCUI->CTRL1   = 0;
    MDR_ADCUI->CTRL2   = 0;
    MDR_ADCUI->CTRL3   = 0;
    MDR_ADCUI->F0CTR   = 0;
    MDR_ADCUI->F0WC    = 0;
    MDR_ADCUI->F0VC    = 0;
    MDR_ADCUI->F0AC    = 0;
    MDR_ADCUI->F0MD0   = 0;
    MDR_ADCUI->F0MD1   = 0;
    MDR_ADCUI->F0VPEAK = 0;
    MDR_ADCUI->F0IPEAK = 0;
    MDR_ADCUI->F0STAT  = DEINIT_FLAGS;
    MDR_ADCUI->F0MASK  = 0;
    MDR_ADCUI->CCAL1   = 0;
    MDR_ADCUI->CCAL4   = 0;

#if defined(USE_MDR32F21QI)

    MDR_ADCUI->F1CTR   = 0;
    MDR_ADCUI->F1WC    = 0;
    MDR_ADCUI->F1VC    = 0;
    MDR_ADCUI->F1AC    = 0;
    MDR_ADCUI->F1MD0   = 0;
    MDR_ADCUI->F1MD1   = 0;
    MDR_ADCUI->F1VPEAK = 0;
    MDR_ADCUI->F1IPEAK = 0;
    MDR_ADCUI->F1STAT  = DEINIT_FLAGS;
    MDR_ADCUI->F1MASK  = 0;
    MDR_ADCUI->F2CTR   = 0;
    MDR_ADCUI->F2WC    = 0;
    MDR_ADCUI->F2VC    = 0;
    MDR_ADCUI->F2AC    = 0;
    MDR_ADCUI->F2MD0   = 0;
    MDR_ADCUI->F2MD1   = 0;
    MDR_ADCUI->F2VPEAK = 0;
    MDR_ADCUI->F2IPEAK = 0;
    MDR_ADCUI->F2STAT  = DEINIT_FLAGS;
    MDR_ADCUI->F2MASK  = 0;
    MDR_ADCUI->CCAL2   = 0;
    MDR_ADCUI->CCAL3   = 0;

#endif
}

/**
 * @brief  Fills each ADCUI_InitStruct member with its default value.
 * @param  ADCUI_InitStruct: pointer to a @ref ADCUI_InitTypeDef structure
 *         which will be initialized.
 * @retval None.
 */
void ADCUI_StructInit(ADCUI_InitTypeDef* ADCUI_InitStruct)
{
    ADCUI_InitStruct->ADCUI_DataResol              = ADCUI_DATA_RESOL_24BIT;
    ADCUI_InitStruct->ADCUI_ZeroCrossLowPassFilter = ADCUI_ZXLPF_FILTER_DISABLE;
    ADCUI_InitStruct->ADCUI_PeriodLength           = ADCUI_PER_LENGTH_1;
    ADCUI_InitStruct->ADCUI_ActivePowerNoLoad      = ADCUI_APNOLOAD_FULL;
    ADCUI_InitStruct->ADCUI_ReactivePowerNoLoad    = ADCUI_VARNOLOAD_FULL;
    ADCUI_InitStruct->ADCUI_FullPowerNoLoad        = ADCUI_VANOLOAD_FULL;
    ADCUI_InitStruct->ADCUI_FreqVEnable            = DISABLE;
    ADCUI_InitStruct->ADCUI_VRefConfig             = ADCUI_REFERENCE_VOLTAGE_INTERNAL;
    ADCUI_InitStruct->ADCUI_VRefBufUse             = ADCUI_USE_VREF_BUF;
#if defined(USE_MDR32F21QI)
    ADCUI_InitStruct->ADCUI_ChopEnable           = DISABLE;
    ADCUI_InitStruct->ADCUI_ChopperFreqPrescaler = ADCUI_CHOPPER_FREQUENCY_DIV_2;
#endif
    ADCUI_InitStruct->ADCUI_ZeroCrossUpdateRMS    = ADCUI_REG_CONTINUOUS_UPDATE;
    ADCUI_InitStruct->ADCUI_IBoostEnable          = DISABLE;
    ADCUI_InitStruct->ADCUI_Divider               = ADCUI_OVERSAMPLING_DIV_256;
    ADCUI_InitStruct->ADCUI_VoltageDropLevel      = 0;
    ADCUI_InitStruct->ADCUI_VoltageHalfCyclesDrop = 0;
    ADCUI_InitStruct->ADCUI_ZeroCrossTimeOut      = 0;
}

/**
 * @brief  Initializes the ADCUI peripheral according to
 *         the specified parameters in the ADCUI_InitStruct.
 * @param  ADCUI_InitStruct: pointer to a @ref ADCUI_InitTypeDef structure that
 *         contains the configuration information for the specified ADCUI peripheral.
 * @retval None.
 */
void ADCUI_Init(ADCUI_InitTypeDef* ADCUI_InitStruct)
{
    uint32_t TempCTRL1, TempCTRL2, TempCTRL3;

    /* Check the parameters */

    assert_param(IS_ADCUI_DATA_RESOL(ADCUI_InitStruct->ADCUI_DataResol));
    assert_param(IS_ZXLPF_FILTER(ADCUI_InitStruct->ADCUI_ZeroCrossLowPassFilter));
    assert_param(IS_ADCUI_PER_LENGTH(ADCUI_InitStruct->ADCUI_PeriodLength));
    assert_param(IS_ADCUI_APNOLOAD(ADCUI_InitStruct->ADCUI_ActivePowerNoLoad));
    assert_param(IS_ADCUI_VARNOLOAD(ADCUI_InitStruct->ADCUI_ReactivePowerNoLoad));
    assert_param(IS_ADCUI_VANOLOAD(ADCUI_InitStruct->ADCUI_FullPowerNoLoad));
    assert_param(IS_FUNCTIONAL_STATE(ADCUI_InitStruct->ADCUI_FreqVEnable));
    assert_param(IS_ADCUI_REFERENCE_VOLTAGE(ADCUI_InitStruct->ADCUI_VRefConfig));
    assert_param(IS_ADCUI_BUFFER_VREF_USE(ADCUI_InitStruct->ADCUI_VRefBufUse));
    assert_param(IS_ADCUI_ZXRMS_REG_UPDATE(ADCUI_InitStruct->ADCUI_ZeroCrossUpdateRMS));
    assert_param(IS_FUNCTIONAL_STATE(ADCUI_InitStruct->ADCUI_IBoostEnable));
    assert_param(IS_ADCUI_OSR_COF(ADCUI_InitStruct->ADCUI_Divider));
    assert_param(IS_ADCUI_SAGLVL(ADCUI_InitStruct->ADCUI_VoltageDropLevel));
    assert_param(IS_ADCUI_SAGCYC(ADCUI_InitStruct->ADCUI_VoltageHalfCyclesDrop));
    assert_param(IS_ADCUI_ZXTOUT(ADCUI_InitStruct->ADCUI_ZeroCrossTimeOut));
#if defined(USE_MDR32F21QI)
    assert_param(IS_ADCUI_CHOPPER_FREQUENCY_PRESCALER(ADCUI_InitStruct->ADCUI_ChopperFreqPrescaler));
    assert_param(IS_FUNCTIONAL_STATE(ADCUI_InitStruct->ADCUI_ChopEnable));
#endif

    /* Config the ADCUI control1 register */

    TempCTRL1 = ((uint32_t)ADCUI_InitStruct->ADCUI_DataResol) |
                ((uint32_t)ADCUI_InitStruct->ADCUI_ZeroCrossLowPassFilter) |
                ((uint32_t)ADCUI_InitStruct->ADCUI_PeriodLength) |
                ((uint32_t)ADCUI_InitStruct->ADCUI_ActivePowerNoLoad) |
                ((uint32_t)ADCUI_InitStruct->ADCUI_ReactivePowerNoLoad) |
                ((uint32_t)ADCUI_InitStruct->ADCUI_FullPowerNoLoad) |
                ((uint32_t)ADCUI_InitStruct->ADCUI_FreqVEnable << ADCUI_CTRL1_FREQSEL_Pos) |
                ((uint32_t)ADCUI_InitStruct->ADCUI_VRefConfig) |
                ((uint32_t)ADCUI_InitStruct->ADCUI_VRefBufUse) |
#if defined(USE_MDR32F21QI)
                ((uint32_t)ADCUI_InitStruct->ADCUI_ChopEnable << ADCUI_CTRL1_CHOP_EN_Pos) |
                ((uint32_t)ADCUI_InitStruct->ADCUI_ChopperFreqPrescaler) |
#endif
                ((uint32_t)ADCUI_InitStruct->ADCUI_ZeroCrossUpdateRMS) |
                ((uint32_t)ADCUI_InitStruct->ADCUI_IBoostEnable << ADCUI_CTRL1_IBOOST_Pos) |
                ((uint32_t)ADCUI_InitStruct->ADCUI_Divider << ADCUI_CTRL1_OSR_CONF_Pos);

    /* Write to ADCUI control1 register */
    MDR_ADCUI->CTRL1 = TempCTRL1;

    /* Config the ADCUI control2 register */
    TempCTRL2 = ((uint32_t)ADCUI_InitStruct->ADCUI_VoltageDropLevel << ADCUI_CTRL2_SAGLVL_Pos) |
                ((uint32_t)ADCUI_InitStruct->ADCUI_VoltageHalfCyclesDrop << ADCUI_CTRL2_SAGCYC_Pos);

    /* Write to ADCUI control2 register */
    MDR_ADCUI->CTRL2 = TempCTRL2;

    TempCTRL3 = ((uint32_t)ADCUI_InitStruct->ADCUI_ZeroCrossTimeOut << ADCUI_CTRL3_ZXTOUT_Pos);

