piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32F2xQI/src/MDR32F2xQI_adcui.c
    /* Write to ADCUI control3 register */
    MDR_ADCUI->CTRL3 = TempCTRL3;
}

/**
 * @brief  Resetting the digital part of the ADC blocks.
 * @param  NewState: new state of the ADC digital part.
 *         This parameter can be a value of @ref FunctionalState.
 * @retval None.
 */
void ADCUI_ResetDigital(FunctionalState NewState)
{
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        MDR_ADCUI->CTRL1 |= ADCUI_CTRL1_RESET_DIG;
    } else {
        MDR_ADCUI->CTRL1 &= ~ADCUI_CTRL1_RESET_DIG;
    }
}

/**
 * @brief Initializes the ADCUI unit Fx peripheral according to
 *        the specified parameters in the ADCUI_FxUnitInitStruct.
 * @param UnitNumber - @ref ADCUI_Unit_TypeDef - the number of the initialized channel.
 * @param ADCUI_FxUnitInitStruct: pointer to a @ref ADCUI_FxUnit_InitTypeDef
 *        structure that contains the configuration information.
 * @retval None.
 */
void ADCUI_Fx_Init(ADCUI_Unit_TypeDef UnitNumber, ADCUI_FxUnit_InitTypeDef* ADCUI_FxUnitInitStruct)
{
    uint32_t TempFxCTR, TempFxMD0;

    /* Check the parameters */
    assert_param(IS_ADCUI_UNIT(UnitNumber));
    assert_param(IS_ADCUI_INT_STATE(ADCUI_FxUnitInitStruct->ADCUI_Fx_IntegratorEnable));
    assert_param(IS_ADCUI_INT_STATE(ADCUI_FxUnitInitStruct->ADCUI_F0_I3IntegratorEnable));
    assert_param(IS_ADCUI_VASEL(ADCUI_FxUnitInitStruct->ADCUI_SourceRegFullPower));
    assert_param(IS_ADCUI_GAIN(ADCUI_FxUnitInitStruct->ADCUI_Fx_IGain));
    assert_param(IS_ADCUI_GAIN(ADCUI_FxUnitInitStruct->ADCUI_Fx_VGain));
    assert_param(IS_ADCUI_FXPHASE(ADCUI_FxUnitInitStruct->ADCUI_Fx_PhaseShift));
    assert_param(IS_ADCUI_GAIN(ADCUI_FxUnitInitStruct->ADCUI_F0_I3Gain));
    assert_param(IS_ADCUI_FXIRMSOS(ADCUI_FxUnitInitStruct->ADCUI_Fx_IRMSCalibration));
    assert_param(IS_ADCUI_VDAT_SOURCE(ADCUI_FxUnitInitStruct->ADCUI_Fx_SourceVDAT));
    assert_param(IS_ADCUI_IDAT_SOURCE(ADCUI_FxUnitInitStruct->ADCUI_Fx_SourceIDAT));
    assert_param(IS_FUNCTIONAL_STATE(ADCUI_FxUnitInitStruct->ADCUI_Fx_6dBIGainEnable));
    assert_param(IS_FUNCTIONAL_STATE(ADCUI_FxUnitInitStruct->ADCUI_Fx_6dBVGainEnable));
    assert_param(IS_FUNCTIONAL_STATE(ADCUI_FxUnitInitStruct->ADCUI_F0_6dBI3GainEnable));
    assert_param(IS_ADCUI_F0I3SEL_SELECT(ADCUI_FxUnitInitStruct->ADCUI_F0_I3SelectDataFilter));
    assert_param(IS_ADCUI_CHANNELI_SELECT(ADCUI_FxUnitInitStruct->ADCUI_F0_IChannelSelect));

#if defined(USE_MDR32F21QI)

    TempFxCTR = ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_IntegratorEnable << ADCUI_FxCTR_FxI0NTEN_Pos) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_F0_I3IntegratorEnable << ADCUI_FxCTR_FxI3NTEN_Pos) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_SourceRegFullPower) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_IGain << ADCUI_FxCTR_FxIGAIN_Pos) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_VGain << ADCUI_FxCTR_FxVGAIN_Pos) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_PhaseShift << ADCUI_FxCTR_FxVPHASE_Pos) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_F0_I3Gain << ADCUI_FxCTR_FxI3GAIN_Pos) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_IRMSCalibration << ADCUI_FxCTR_FxIRMSOS_Pos);

    TempFxMD0 = ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_SourceVDAT) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_SourceIDAT << ADCUI_FxMD0_FxISEL_Pos) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_6dBIGainEnable << ADCUI_FxMD0_IxGAIN_Pos) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_6dBVGainEnable << ADCUI_FxMD0_VxGAIN_Pos) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_F0_6dBI3GainEnable << ADCUI_FxMD0_I3GAIN_Pos) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_F0_I3SelectDataFilter) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_F0_IChannelSelect << ADCUI_FxMD0_FxSEL_I_CH_Pos);

#elif defined(USE_MDR32F23QI)

    TempFxCTR = ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_IntegratorEnable << ADCUI_F0CTR_F0I0NTEN_Pos) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_F0_I3IntegratorEnable << ADCUI_F0CTR_F0I3NTEN_Pos) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_SourceRegFullPower) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_IGain << ADCUI_F0CTR_F0I0GAIN_Pos) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_VGain << ADCUI_F0CTR_F0VGAIN_Pos) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_PhaseShift << ADCUI_F0CTR_F0VPHASE_Pos) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_F0_I3Gain << ADCUI_F0CTR_F0I3GAIN_Pos) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_IRMSCalibration << ADCUI_F0CTR_F0IRMSOS_Pos);

    TempFxMD0 = ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_SourceVDAT) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_SourceIDAT << ADCUI_F0MD0_F0ISEL_Pos) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_6dBIGainEnable << ADCUI_F0MD0_I0GAIN_Pos) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_Fx_6dBVGainEnable << ADCUI_F0MD0_V0GAIN_Pos) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_F0_6dBI3GainEnable << ADCUI_F0MD0_I3GAIN_Pos) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_F0_I3SelectDataFilter) |
                ((uint32_t)ADCUI_FxUnitInitStruct->ADCUI_F0_IChannelSelect << ADCUI_F0MD0_F0SEL_I_CH_Pos);

#endif

    switch (UnitNumber) {
        case ADCUI_F0_UNIT:
            MDR_ADCUI->F0CTR = TempFxCTR;
            MDR_ADCUI->F0MD0 = TempFxMD0;
            break;
#if defined(USE_MDR32F21QI)
        case ADCUI_F1_UNIT:
            MDR_ADCUI->F1CTR = TempFxCTR;
            MDR_ADCUI->F1MD0 = TempFxMD0;
            break;
        case ADCUI_F2_UNIT:
            MDR_ADCUI->F2CTR = TempFxCTR;
            MDR_ADCUI->F2MD0 = TempFxMD0;
            break;
#endif
    }
}

/**
 * @brief Fills each ADCUI_FxUnitInitStruct member with its default value.
 * @param ADCUI_FxUnitInitStruct: pointer to a @ref ADCUI_FxUnit_InitTypeDef
 *        structure which will be initialized.
 * @retval None.
 */
void ADCUI_Fx_StructInit(ADCUI_FxUnit_InitTypeDef* ADCUI_FxUnitInitStruct)
{
    ADCUI_FxUnitInitStruct->ADCUI_Fx_IntegratorEnable   = ADCUI_INT_DISABLE;
    ADCUI_FxUnitInitStruct->ADCUI_F0_I3IntegratorEnable = ADCUI_INT_DISABLE;
    ADCUI_FxUnitInitStruct->ADCUI_SourceRegFullPower    = ADCUI_FULL_ENERGY;
    ADCUI_FxUnitInitStruct->ADCUI_Fx_IGain              = ADCUI_GAIN_0dB;
    ADCUI_FxUnitInitStruct->ADCUI_Fx_VGain              = ADCUI_GAIN_0dB;
    ADCUI_FxUnitInitStruct->ADCUI_Fx_PhaseShift         = 0;
    ADCUI_FxUnitInitStruct->ADCUI_F0_I3Gain             = ADCUI_GAIN_0dB;
    ADCUI_FxUnitInitStruct->ADCUI_Fx_IRMSCalibration    = 0;
    ADCUI_FxUnitInitStruct->ADCUI_Fx_SourceVDAT         = ADCUI_Fx_U_VDAT;
    ADCUI_FxUnitInitStruct->ADCUI_Fx_SourceIDAT         = ADCUI_Fx_I_IDAT;
    ADCUI_FxUnitInitStruct->ADCUI_Fx_6dBIGainEnable     = DISABLE;
    ADCUI_FxUnitInitStruct->ADCUI_Fx_6dBVGainEnable     = DISABLE;
    ADCUI_FxUnitInitStruct->ADCUI_F0_6dBI3GainEnable    = DISABLE;
    ADCUI_FxUnitInitStruct->ADCUI_F0_I3SelectDataFilter = ADCUI_F0I3SEL_AFTER_FILTER;
    ADCUI_FxUnitInitStruct->ADCUI_F0_IChannelSelect     = ADCUI_F0_I_CH_AUTO;
}

/**
 * @brief  ADCUI Channel configuaration.
 * @param  Channels: specifies the ADCUI channel to be enabled or disabled.
 *         This parameter can be any combination of @ref ADCUI_Channel_TypeDef values.
 * @param  NewState: new state of the specified ADCUI Channels.
 *         This parameter can be: ENABLE or DISABLE.
 * @retval None.
 */
void ADCUI_ChannelConfig(uint32_t Channels, FunctionalState NewState)
{
    /* Check the parameters */

    assert_param(IS_ADCUI_CHANNELS(Channels));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

