piborisovich/microcontrollers/Milandr/Libraries/SPL/MDR32F2xQI/src/MDR32F2xQI_adcui.c
    if (NewState != DISABLE) {
        MDR_ADCUI->CTRL1 |= Channels;
    } else {
        MDR_ADCUI->CTRL1 &= ~Channels;
    }
}

/**
 * @brief  Returns the ADCUI result of specific channel.
 * @param  ChannelNumber - @ref ADCUI_Channel_TypeDef - the channel number.
 * @retval ADCUI Result Register value for the specified channel.
 */
uint32_t ADCUI_GetResult(ADCUI_Channel_TypeDef ChannelNumber)
{
    uint32_t ResultChannel;

    /* Check the parameters */
    assert_param(IS_ADCUI_CHANNEL(ChannelNumber));

    switch (ChannelNumber) {
        case ADCUI_CH_F0_I0:
            ResultChannel = MDR_ADCUI->F0I0DAT;
            break;
        case ADCUI_CH_F0_V0:
            ResultChannel = MDR_ADCUI->F0VDAT;
            break;
#if defined(USE_MDR32F21QI)
        case ADCUI_CH_F1_I1:
            ResultChannel = MDR_ADCUI->F1IDAT;
            break;
        case ADCUI_CH_F1_V1:
            ResultChannel = MDR_ADCUI->F1VDAT;
            break;
        case ADCUI_CH_F2_I2:
            ResultChannel = MDR_ADCUI->F2IDAT;
            break;
        case ADCUI_CH_F2_V2:
            ResultChannel = MDR_ADCUI->F2VDAT;
            break;
#endif
        case ADCUI_CH_F0_I3:
            ResultChannel = MDR_ADCUI->F0I3DAT;
            break;
    }
    return (ResultChannel);
}

/**
 * @brief  Reset certain flags in one of the ADCUI blocks.
 * @param  UnitNumber: Select the Fx unit.
 *         This parameter can be one of the following values @ref ADCUI_Unit_TypeDef.
 * @param  Flags: specifies the flags to clear.
 *         This parameter can be one of the @ref ADCUI_Flags_TypeDef values.
 * @retval None
 */
void ADCUI_ClearFlags(ADCUI_Unit_TypeDef UnitNumber, uint32_t Flags)
{
    /* Check the parameters */
    assert_param(IS_ADCUI_UNIT(UnitNumber));
    assert_param(IS_ADCUI_FLAG(Flags));

    switch (UnitNumber) {
        case ADCUI_F0_UNIT:
            MDR_ADCUI->F0STAT = MDR_ADCUI->F0STAT & ~Flags;
            break;
#if defined(USE_MDR32F21QI)
        case ADCUI_F1_UNIT:
            MDR_ADCUI->F1STAT = MDR_ADCUI->F1STAT & ~Flags;
            break;
        case ADCUI_F2_UNIT:
            MDR_ADCUI->F2STAT = MDR_ADCUI->F0STAT & ~Flags;
            break;
#endif
    }
}

/**
 * @brief  Checks whether the specified ADCUI flag is set or not.
 * @param  UnitNumber: Select the Fx unit.
 *         This parameter can be one of the following values @ref ADCUI_Unit_TypeDef.
 * @param  ADCUI_Flag: specifies the flag to check.
 *         This parameter can be one of the @ref ADCUI_Flags_TypeDef values.
 * @retval @ref FlagStatus - The state of ADCUI flag (SET or RESET).
 */
FlagStatus ADCUI_GetFlagStatus(ADCUI_Unit_TypeDef UnitNumber, ADCUI_Flags_TypeDef ADCUI_Flag)
{
    FlagStatus BitStatus;

    /* Check the parameters */
    assert_param(IS_ADCUI_UNIT(UnitNumber));
    assert_param(IS_ADCUI_FLAG(ADCUI_Flag));

    switch (UnitNumber) {

        case ADCUI_F0_UNIT:
            if (MDR_ADCUI->F0STAT & ADCUI_Flag) {
                BitStatus = SET;
            } else {
                BitStatus = RESET;
            }
            break;
#if defined(USE_MDR32F21QI)
        case ADCUI_F1_UNIT:
            if (MDR_ADCUI->F1STAT & ADCUI_Flag) {
                BitStatus = SET;
            } else {
                BitStatus = RESET;
            }
            break;
        case ADCUI_F2_UNIT:
            if (MDR_ADCUI->F2STAT & ADCUI_Flag) {
                BitStatus = SET;
            } else {
                BitStatus = RESET;
            }
            break;
#endif
    }
    return (BitStatus);
}

/**
 * @brief  Returns the ADCUI Fx unit Status Flags combined value.
 * @param  UnitNumber: Select the Fx unit.
 *         This parameter can be one of the following values @ref ADCUI_Unit_TypeDef.
 * @retval The ADCUI Status Flags combined value.
 */
uint32_t ADCUI_GetStatus(ADCUI_Unit_TypeDef UnitNumber)
{
    uint32_t StatusFlags;

    /* Check the parameters */
    assert_param(IS_ADCUI_UNIT(UnitNumber));

    switch (UnitNumber) {
        case ADCUI_F0_UNIT:
            StatusFlags = MDR_ADCUI->F0STAT & ADCUI_FLAGS_MASK;
            break;
#if defined(USE_MDR32F21QI)
        case ADCUI_F1_UNIT:
            StatusFlags = MDR_ADCUI->F1STAT & ADCUI_FLAGS_MASK;
            break;
        case ADCUI_F2_UNIT:
            StatusFlags = MDR_ADCUI->F2STAT & ADCUI_FLAGS_MASK;
            break;
#endif
    }
    return (StatusFlags);
}

/**
 * @brief  Reset certain IT flags in one of the ADCUI blocks.
 * @param  UnitNumber: Select the Fx unit.
 *         This parameter can be one of the following values @ref ADCUI_Unit_TypeDef.
 * @param  ITFlags: specifies the IT flags to clear.
 *         This parameter can be one of the @ref ADCUI_IT_TypeDef values.
 * @retval None
 */
void ADCUI_ClearITFlags(ADCUI_Unit_TypeDef UnitNumber, uint32_t ITFlags)
{
    /* Check the parameters */
    assert_param(IS_ADCUI_UNIT(UnitNumber));
    assert_param(IS_ADCUI_FLAG(ITFlags));

    switch (UnitNumber) {
        case ADCUI_F0_UNIT:
            MDR_ADCUI->F0STAT = MDR_ADCUI->F0STAT & ~ITFlags;
            break;
#if defined(USE_MDR32F21QI)
        case ADCUI_F1_UNIT:
            MDR_ADCUI->F1STAT = MDR_ADCUI->F1STAT & ~ITFlags;
            break;
        case ADCUI_F2_UNIT:
            MDR_ADCUI->F2STAT = MDR_ADCUI->F0STAT & ~ITFlags;
            break;
#endif
    }
}

/**
 * @brief  Checks whether the specified ADCUI IT flag is set or not.
 * @param  UnitNumber: Select the Fx unit.
 *         This parameter can be one of the following values @ref ADCUI_Unit_TypeDef.
 * @param  ADCUI_ITFlag: specifies the IT flag to check.
 *         This parameter can be one of the @ref ADCUI_IT_TypeDef values.
 * @retval @ref FlagStatus - The state of ADCUI IT flag (SET or RESET).
 */
FlagStatus ADCUI_GetITFlagStatus(ADCUI_Unit_TypeDef UnitNumber, ADCUI_IT_TypeDef ADCUI_ITFlag)
{
    FlagStatus BitStatus;

    /* Check the parameters */
    assert_param(IS_ADCUI_UNIT(UnitNumber));
    assert_param(IS_ADCUI_FLAG(ADCUI_ITFlag));

    switch (UnitNumber) {

        case ADCUI_F0_UNIT:
            if (MDR_ADCUI->F0STAT & ADCUI_ITFlag) {
                BitStatus = SET;
            } else {
                BitStatus = RESET;
            }
            break;
#if defined(USE_MDR32F21QI)
        case ADCUI_F1_UNIT:
            if (MDR_ADCUI->F1STAT & ADCUI_ITFlag) {
                BitStatus = SET;
            } else {
                BitStatus = RESET;
            }
            break;
        case ADCUI_F2_UNIT:
            if (MDR_ADCUI->F2STAT & ADCUI_ITFlag) {
                BitStatus = SET;
            } else {
                BitStatus = RESET;
            }
            break;
#endif
    }
    return (BitStatus);
}

/**
 * @brief  Returns the ADCUI Fx unit Status IT Flags combined value.
 * @param  UnitNumber: Select the Fx unit.
 *         This parameter can be one of the following values @ref ADCUI_Unit_TypeDef.
 * @retval The ADCUI Status IT Flags combined value.
 */
uint32_t ADCUI_GetITStatus(ADCUI_Unit_TypeDef UnitNumber)
{
    uint32_t StatusITFlags;

    /* Check the parameters */
    assert_param(IS_ADCUI_UNIT(UnitNumber));

    switch (UnitNumber) {
        case ADCUI_F0_UNIT:
            StatusITFlags = MDR_ADCUI->F0STAT & ADCUI_IT_MASK;
            break;
#if defined(USE_MDR32F21QI)
        case ADCUI_F1_UNIT:
            StatusITFlags = MDR_ADCUI->F1STAT & ADCUI_IT_MASK;
            break;
        case ADCUI_F2_UNIT:
            StatusITFlags = MDR_ADCUI->F2STAT & ADCUI_IT_MASK;
            break;
#endif
    }
    return (StatusITFlags);
}

/**
 * @brief  Enables or disables the ADCUI interrupts.
 * @param  UnitNumber: Select the Fx unit.
 *         This parameter can be one of the following values @ref ADCUI_Unit_TypeDef.
 * @param  ADCUI_IT: specifies the ADCUI interrupt sources to be enabled or disabled.
 *         This parameter can be any combination of:
 *           @arg ADCUI_Fx_IT_VF_EMP.
 *           @arg ADCUI_Fx_IT_VF_FLL.
 *           @arg ADCUI_Fx_IT_VF_OVR.
 *           @arg ADCUI_Fx_IT_IF_EMP.
 *           @arg ADCUI_Fx_IT_IF_FLL.
 *           @arg ADCUI_Fx_IT_IF_OVR.
 *           @arg ADCUI_Fx_IT_SAGF.
 *           @arg ADCUI_Fx_IT_PEAKVF.
 *           @arg ADCUI_Fx_IT_PEAKIF.
 *           @arg ADCUI_Fx_IT_WATTOVP.
 *           @arg ADCUI_Fx_IT_VAROVP.
 *           @arg ADCUI_Fx_IT_VAOV.
 *           @arg ADCUI_Fx_IT_ZXTOF.
 *           @arg ADCUI_Fx_IT_FAULTCON.
 *           @arg ADCUI_Fx_IT_APSIGN.
 *           @arg ADCUI_Fx_IT_APNLDFL.
 *           @arg ADCUI_Fx_IT_VARSIGN.
 *           @arg ADCUI_Fx_IT_VARNLDFL.
 *           @arg ADCUI_Fx_IT_VANLDFL.
 *           @arg ADCUI_Fx_IT_ZEROCRS.
 *           @arg ADCUI_Fx_IT_C3IF_EMP.
 *           @arg ADCUI_Fx_IT_C3IF_FLL.
 *           @arg ADCUI_Fx_IT_C3IF_OVR.
 *           @arg ADCUI_Fx_IT_WATTOVN.
 *           @arg ADCUI_Fx_IT_VAROVN.
 * @param  NewState - @ref FunctionalState - new state of the ADCUI interrupts.
 * @retval None.
 */
void ADCUI_ITConfig(ADCUI_Unit_TypeDef UnitNumber, uint32_t ADCUI_IT, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_ADCUI_UNIT(UnitNumber));
    assert_param(IS_ADCUI_ITS(ADCUI_IT));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    /* Config IT state */
    switch (UnitNumber) {

        case ADCUI_F0_UNIT:
            if (NewState != DISABLE) {
                MDR_ADCUI->F0MASK |= ADCUI_IT;
            } else {
                MDR_ADCUI->F0MASK &= ~ADCUI_IT;
            }
            break;
#if defined(USE_MDR32F21QI)
        case ADCUI_F1_UNIT:
            if (NewState != DISABLE) {
                MDR_ADCUI->F1MASK |= ADCUI_IT;
            } else {
                MDR_ADCUI->F1MASK &= ~ADCUI_IT;
            }
            break;
        case ADCUI_F2_UNIT:
            if (NewState != DISABLE) {
                MDR_ADCUI->F2MASK |= ADCUI_IT;
            } else {
                MDR_ADCUI->F2MASK &= ~ADCUI_IT;
            }
            break;
#endif
    }
}

/** @} */ /* End of group ADCUI_Exported_Functions */

/** @} */ /* End of group ADCUI */

/** @} */ /* End of group __MDR32F2xQI_StdPeriph_Driver */

/*********************** (C) COPYRIGHT 2025 Milandr ****************************
 *
 * END OF FILE MDR32F2xQI_adcui.c */

